FemDesign.Geometry.Point3d.Origin
Construct FdPoint3d in origin

FemDesign.Geometry.Point3d.#ctor
Parameterless constructor for serialization.

FemDesign.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Construct FdPoint3d from coordinates x, y and z.
x:
y:
z:

FemDesign.Geometry.Point3d.op_Addition(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d)
Move a point p along vector v

FemDesign.Geometry.Point3d.op_Addition(FemDesign.Geometry.Vector3d,FemDesign.Geometry.Point3d)
Move a point p along vector v

FemDesign.Geometry.Point3d.op_Subtraction(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d)
Move a point p along vector -v

FemDesign.Geometry.Point3d.op_Subtraction(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d)
Create vector from p2 to p1

FemDesign.Geometry.Point3d.Translate(FemDesign.Geometry.Vector3d)
Translate a point by a vector.
v: Vector.
Returns:

FemDesign.Geometry.Point3d.To2d
Project point on XY-plane.
Returns: